doom/config.el
;;; ~/.config/doom/config.el -*- lexical-binding: t; -*-
(setq! user-full-name "hyluo"
       user-mail-address "hyluo.1999@qq.com")

(setq! doom-font (font-spec :family "Monaco" :size 15 :weight 'normal :width 'normal)
       doom-variable-pitch-font (font-spec :family "Monaco" :size 15 :weight 'normal :width 'normal)
       doom-big-font (font-spec :family "Monaco" :szie 26))
(defun init-cjk-fonts()
  (if (display-graphic-p)
      (dolist (charset '(kana han cjk-misc bopomofo))
        (set-fontset-font (frame-parameter nil 'font)
                          charset (font-spec :family "Hiragino Sans GB" :size 18)))))
(add-hook 'doom-init-ui-hook #'init-cjk-fonts)

(setq! doom-theme 'doom-one)
;; (add-hook! LaTeX-mode (load-theme 'doom-gruvbox-light))
(setq fancy-splash-image (concat doom-private-dir "splash.png"))
;; Hide the menu for as minimalistic a startup screen as possible.
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(map! :leader :desc "Find file split" :n ">" #'find-file-other-window)

(setq! display-line-numbers-type t
       split-height-threshold nil
       split-width-threshold 10
       mac-pass-command-to-system nil)
(add-to-list 'initial-frame-alist '(fullscreen . maximized))

(autoload 'ffap-file-at-point "ffap")
(defun complete-path-at-point+ ()
  "Return completion data for UNIX path at point."
  (let ((fn (ffap-file-at-point))
        (fap (thing-at-point 'filename)))
    (when (and (or fn (equal "/" fap))
               (save-excursion
                 (search-backward fap (line-beginning-position) t)))
      (list (match-beginning 0)
            (match-end 0)
            #'completion-file-name-table :exclusive 'no))))

(add-hook 'completion-at-point-functions
          #'complete-path-at-point+
          'append)



(setq! org-directory "~/Documents/org"
       org-preview-latex-default-process 'dvisvgm
       ;; org-highlight-latex-and-related '(native)
       org-latex-pdf-process '("latexmk -f -pdf -xelatex -interaction=nonstopmode -output-directory=%o %f")
       org-file-apps '((auto-mode . emacs)
                       (directory . emacs)
                       ("\\.mm\\'" . default)
                       ("\\.x?html?\\'" . default)
                       ("\\.pdf\\'" . emacs))
       org-emphasis-alist '(("*" (bold :foreground "Orange"))
                            ("/" italic)
                            ("_" underline)
                            ("=" org-verbatim verbatim)
                            ("~" org-code verbatim)
                            ("+" (:strike-through t))))

(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq! org-tags-exclude-from-inheritance (quote("crypt"))
      org-crypt-key nil)

(setq! org-capture-templates '(("t" "Personal todo" entry
                                (file+headline +org-capture-todo-file "Inbox")
                                "* [ ] %?\n%i\n%a" :prepend t)
                               ("n" "Personal notes" entry
                                (file+headline +org-capture-notes-file "Inbox")
                                "* %u %?\n%i\n%a" :prepend t)
                               ("j" "Journal" entry
                                (file+olp+datetree +org-capture-journal-file)
                                "* %U %?\n%i\n%a" :prepend t)
                               ("p" "Templates for projects")
                               ("pt" "Project-local todo" entry
                                (file+headline +org-capture-project-todo-file "Inbox")
                                "* TODO %?\n%i\n%a" :prepend t)
                               ("pn" "Project-local notes" entry
                                (file+headline +org-capture-project-notes-file "Inbox")
                                "* %U %?\n%i\n%a" :prepend t)
                               ("pc" "Project-local changelog" entry
                                (file+headline +org-capture-project-changelog-file "Unreleased")
                                "* %U %?\n%i\n%a" :prepend t)
                               ("o" "Centralized templates for projects")
                               ("ot" "Project todo" entry #'+org-capture-central-project-todo-file "* TODO %?\n %i\n %a" :heading "Tasks" :prepend nil)
                               ("on" "Project notes" entry #'+org-capture-central-project-notes-file "* %U %?\n %i\n %a" :heading "Notes" :prepend t)
                               ("oc" "Project changelog" entry #'+org-capture-central-project-changelog-file "* %U %?\n %i\n %a" :heading "Changelog" :prepend t)))

(require 'cal-china-x)
(setq! calendar-week-start-day 1
       org-agenda-include-diary t
       diary-file (expand-file-name "hyluo-diary" org-directory)
       mark-holidays-in-calendar t
       cal-china-x-important-holidays cal-china-x-chinese-holidays
       cal-china-x-general-holidays '((holiday-lunar 1 15 "元宵节"))
       calendar-holidays (append cal-china-x-important-holidays cal-china-x-general-holidays))

(setq! citar-bibliography (expand-file-name "bib/references.bib" org-directory)
       bibtex-completion-bibliography citar-bibliography
       citar-notes-paths '("/User/luohongyang/Documents/org/references/")
       citar-open-note-function 'orb-citar-edit-note)

(after! org-roam (setq! org-roam-db-gc-threshold most-positive-fixnum
                        org-roam-directory (expand-file-name "roam" org-directory)
                        org-roam-capture-templates '(("d" "default" plain "%?"
                                                      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+created: %U\n#+last_modified: %U\n\n")
                                                      :unnarrowed t)
                                                     ("r" "bibliography reference" plain "%?"
                                                      :target (file+head "references/${citekey}.org" "#+title: ${title}\n#+created: %U\n#+last_modified: %U\n\n")
                                                      :unnarrowed t))))
(org-roam-db-autosync-mode)
(setq! time-stamp-active t
       time-stamp-start "#\\+last_modified:[ \t]*"
       time-stamp-end "$"
       time-stamp-format "\[%Y-%02m-%02d %3a %02H:%02M\]")
(add-hook 'before-save-hook 'time-stamp nil)
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (push arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
(map! :leader
      :desc "later finish node"
      "n r l" #'org-roam-node-insert-immediate)
