doom/config.org
** Chinese IME -- RIME Set
主要是 rime 在 emacs 里面可以根据前后情况来自动切换中英文真的太爽了。
#+begin_src emacs-lisp
(use-package! rime
  ;; :hook
  ;; :init
  :config
  (define-key rime-mode-map (kbd "M-q") 'rime-force-enable)
  (defun rime-predicate-tex-math-or-command-p ()
    "If point is inside a (La)TeX math environment, or a (La)TeX command.

    Return true if the buffer is in `tex-mode' and one of the following three cases occurs:

    1. The point is inside a (La)TeX math environment;
    2. The current character is `$' or `\\', either at the beginning of a line, or after an ascii/space.
    3. The string before the point is of the form a (La)TeX command. If the command have a parameter, it is closed by `}' or `%'. If not, it is closed by a space or `%'.

    Can be used in `rime-disable-predicates' and `rime-inline-predicates'."
    (and (derived-mode-p 'tex-mode 'org-mode)
         (or (and (featurep 'tex-site)
                  (texmathp))
             (and rime--current-input-key
                  (or (= #x24 rime--current-input-key)
                      (= #x5c rime--current-input-key))
                  (or (= (point) (line-beginning-position))
                      (= #x20 (char-before))
                      (rime-predicate-after-ascii-char-p)))
             (and (> (point) (save-excursion (back-to-indentation) (point)))
                  (let ((string (buffer-substring (point) (max (line-beginning-position) (- (point) 80)))))
                    (or (string-match-p "[\x5c][\x21-\x24\x26-\x7e]*$" string)
                        (string-match-p "[\x5c][a-zA-Z\x23\x40]+[\x7b][^\x7d\x25]*$" string)))))))
  (setq! rime-show-candidate 'posframe
         rime-emacs-module-header-root "/opt/homebrew/opt/emacs-mac/include"
         rime-show-preedit 'inline
         default-input-method "rime"
         rime-librime-root (expand-file-name "librime/dist" user-emacs-directory)
         rime-disable-predicates '(rime-predicate-after-alphabet-char-p          ;;在英文字符串之后（必须为以字母开头的英文字符串）
                                   rime-predicate-after-ascii-char-p             ;;任意英文字符后
                                   rime-predicate-prog-in-code-p                 ;;在`prog-mode'和`conf-mode'中除了注释和引号内字符串之外的区域
                                   rime-predicate-in-code-string-p               ;;在代码的字符串中，不含注释的字符串。
                                   rime-predicate-evil-mode-p                    ;;在`evil-mode'的非编辑状态下
                                        ;rime-predicate-ace-window-p                   ;;激活`ace-window-mode'
                                        ;rime-predicate-hydra-p                        ;;如果激活了一个`hydra'keymap
                                        ;rime-predicate-current-input-punctuation-p    ;;当要输入的是符号时
                                   rime-predicate-punctuation-after-space-cc-p   ;;当要在中文字符且有空格之后输入符号时
                                   rime-predicate-punctuation-after-ascii-p      ;;当要在任意英文字符之后输入符号时
                                   rime-predicate-punctuation-line-begin-p       ;;在行首要输入符号时
                                        ;rime-predicate-space-after-ascii-p            ;;在任意英文字符且有空格之后
                                   rime-predicate-space-after-cc-p               ;;在中文字符且有空格之后
                                   rime-predicate-current-uppercase-letter-p     ;;将要输入的为大写字母时
                                        ;rime-predicate-org-in-src-block-p             ;;在`org-src-block'中时
                                   rime-predicate-tex-math-or-command-p)         ;;在 (La)TeX 数学环境中或者输入 (La)TeX 命令时
         rime-posframe-properties (list :font (font-spec :family "Hiragino Sans GB" :size 18)
                                        :internal-border-width 3)))
#+end_src
** Mac's key Sets
主要还是为了贴合 linux 的操作习惯吧，按上去 Alt 作为 meta 在一些场景下也更舒服
#+begin_src emacs-lisp
(setq! mac-command-modifier     'meta
       mac-option-modifier      'super)
#+end_src
** Latex Sets
#+begin_src emacs-lisp
(setq-default TeX-engine 'xetex)
(setq! +latex-viewers '(pdf-tools)
       reftex-default-bibliography (expand-file-name "bib/references.bib" org-directory)
       TeX-command-extra-options "-view=none")
#+end_src
*** cd Latex sets
#+begin_src emacs-lisp
(map! :map cdlatex-mode-map
      :i "TAB" #'cdlatex-tab)
(setq! cdlatex-command-alist '(("fra" "Insert \\frac{}{}" "\\frac{?}{}" cdlatex-position-cursor nil nil t)))
#+end_src
** Company Sets
#+begin_src emacs-lisp
;; (after! company (setq! company-idle-delay 1.0))
#+end_src
** Which-key Sets
#+begin_src emacs-lisp
;; (after! which-key (setq! which-key-idle-delay 1.0
;;                          which-key-max-description-length 80))
#+end_src
** Smartparrens
#+begin_src emacs-lisp
(sp-local-pair 'org-mode "$" "$")
#+end_src
